SkydiverMCU/mcu-iap-demo/STAR-MC1/MM32F5370/USART/MM32F5370_Application/Device/MM32F5370/Include/reg_usart.h
/**
  * @brief USART_GTPR Register Bit Definition
  */
#define  USART_GTPR_PSC_Pos                       (0)
#define  USART_GTPR_PSC_Msk                       (0xFFU << USART_GTPR_PSC_Pos)                     /*!<Prescaler value*/
#define  USART_GTPR_PSC                           USART_GTPR_PSC_Msk
#define  USART_GTPR_PSC_Bit0                      (0x01U << USART_GTPR_PSC_Pos) 
#define  USART_GTPR_PSC_Bit1                      (0x02U << USART_GTPR_PSC_Pos) 
#define  USART_GTPR_PSC_Bit2                      (0x04U << USART_GTPR_PSC_Pos) 
#define  USART_GTPR_PSC_Bit3                      (0x08U << USART_GTPR_PSC_Pos) 
#define  USART_GTPR_PSC_Bit4                      (0x10U << USART_GTPR_PSC_Pos) 
#define  USART_GTPR_PSC_Bit5                      (0x20U << USART_GTPR_PSC_Pos) 
#define  USART_GTPR_PSC_Bit6                      (0x40U << USART_GTPR_PSC_Pos) 
#define  USART_GTPR_PSC_Bit7                      (0x80U << USART_GTPR_PSC_Pos) 
#define  USART_GTPR_GCNT_Pos                      (8)
#define  USART_GTPR_GCNT_Msk                      (0xFFU << USART_GTPR_GCNT_Pos)                    /*!<Smartcard guard time value This bits are used to configure the smartcard guard time value (unit: 1etu).*/
#define  USART_GTPR_GCNT                          USART_GTPR_GCNT_Msk
#define  USART_GTPR_GCNT_Bit0                     (0x01U << USART_GTPR_GCNT_Pos) 
#define  USART_GTPR_GCNT_Bit1                     (0x02U << USART_GTPR_GCNT_Pos) 
#define  USART_GTPR_GCNT_Bit2                     (0x04U << USART_GTPR_GCNT_Pos) 
#define  USART_GTPR_GCNT_Bit3                     (0x08U << USART_GTPR_GCNT_Pos) 
#define  USART_GTPR_GCNT_Bit4                     (0x10U << USART_GTPR_GCNT_Pos) 
#define  USART_GTPR_GCNT_Bit5                     (0x20U << USART_GTPR_GCNT_Pos) 
#define  USART_GTPR_GCNT_Bit6                     (0x40U << USART_GTPR_GCNT_Pos) 
#define  USART_GTPR_GCNT_Bit7                     (0x80U << USART_GTPR_GCNT_Pos) 

/**
  * @brief USART_WUADDR Register Bit Definition
  */
#define  USART_WUADDR_WAD_Pos                     (0)
#define  USART_WUADDR_WAD_Msk                     (0xFFU << USART_WUADDR_WAD_Pos)                   /*!<WakeUp ADDRess Mark bits*/
#define  USART_WUADDR_WAD                         USART_WUADDR_WAD_Msk
#define  USART_WUADDR_WAD_Bit0                    (0x01U << USART_WUADDR_WAD_Pos) 
#define  USART_WUADDR_WAD_Bit1                    (0x02U << USART_WUADDR_WAD_Pos) 
#define  USART_WUADDR_WAD_Bit2                    (0x04U << USART_WUADDR_WAD_Pos) 
#define  USART_WUADDR_WAD_Bit3                    (0x08U << USART_WUADDR_WAD_Pos) 
#define  USART_WUADDR_WAD_Bit4                    (0x10U << USART_WUADDR_WAD_Pos) 
#define  USART_WUADDR_WAD_Bit5                    (0x20U << USART_WUADDR_WAD_Pos) 
#define  USART_WUADDR_WAD_Bit6                    (0x40U << USART_WUADDR_WAD_Pos) 
#define  USART_WUADDR_WAD_Bit7                    (0x80U << USART_WUADDR_WAD_Pos) 
#define  USART_WUADDR_WADM_Pos                    (8)
#define  USART_WUADDR_WADM_Msk                    (0xFFU << USART_WUADDR_WADM_Pos)                  /*!<Wakeup address mask bits*/
#define  USART_WUADDR_WADM                        USART_WUADDR_WADM_Msk
#define  USART_WUADDR_WADM_Bit0                   (0x01U << USART_WUADDR_WADM_Pos) 
#define  USART_WUADDR_WADM_Bit1                   (0x02U << USART_WUADDR_WADM_Pos) 
#define  USART_WUADDR_WADM_Bit2                   (0x04U << USART_WUADDR_WADM_Pos) 
#define  USART_WUADDR_WADM_Bit3                   (0x08U << USART_WUADDR_WADM_Pos) 
#define  USART_WUADDR_WADM_Bit4                   (0x10U << USART_WUADDR_WADM_Pos) 
#define  USART_WUADDR_WADM_Bit5                   (0x20U << USART_WUADDR_WADM_Pos) 
#define  USART_WUADDR_WADM_Bit6                   (0x40U << USART_WUADDR_WADM_Pos) 
#define  USART_WUADDR_WADM_Bit7                   (0x80U << USART_WUADDR_WADM_Pos) 


#endif

